# Проверка четности числа
# Задание 2
number = int(input("Введите число: "))

if number % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")