# Напишите программу, которая выводит все числа от 1 до 10.
# Задание 1
for i in range(1, 11):
    print(i)