# Сумма чисел от 1 до n
# Задание 3
N = int(input("Введите число N: "))
total_sum = sum(range(1, N+1))
print("Сумма чисел от 1 до", N, "равна:", total_sum)